package com.jayud.finance.enums;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * 供应商或客户名称的金蝶-云报关字段对应枚举
 */
@Getter
@AllArgsConstructor
public enum CustomsCompanyEnum {
COMPNAME1("SCT码头","蛇口集装箱码头有限公司"),
COMPNAME2("cct码头","赤湾集装箱码头有限公司"),
COMPNAME3("东方海外","深圳中远海运国际货运有限公司（蛇口东方海外）"),
COMPNAME4("花兴","花兴"),
COMPNAME5("汇安","深圳市汇安国际货运代理有限公司"),
COMPNAME6("佳裕达国际","深圳市佳裕达国际货运代理有限公司"),
COMPNAME7("俊励（蛇口）","深圳市俊励国际船舶代理有限公司（蛇口）"),
COMPNAME8("俊励（盐田）","深圳市俊励国际船舶代理有限公司盐田分公司"),
COMPNAME9("深圳联代","深圳联合国际船舶代理有限公司（蛇口）"),
COMPNAME10("外代","中国深圳外轮代理有限公司"),
COMPNAME11("外轮代理","中国深圳外轮代理有限公司盐田分公司"),
COMPNAME12("外运","深圳中外运船务代理有限公司（蛇口）"),
COMPNAME13("新海丰","上海新海丰集装箱运输有限公司深圳分公司"),
COMPNAME14("盐田港","盐田国际集装箱码头有限公司"),
COMPNAME15("盐田联合船代","深圳联合国际船舶代理有限公司（盐田）"),
COMPNAME16("招商船代","深圳市招商国际船舶代理有限公司盐田分公司"),
COMPNAME17("招商船代蛇口","深圳市招商国际船舶代理有限公司（蛇口）"),
COMPNAME18("中远（蛇口）","深圳中远海运国际货运有限公司（蛇口）"),
COMPNAME19("亚联利成富","深圳亚联利成富港航服务有限公司"),
COMPNAME20("中远（盐田）","深圳中远海运国际货运有限公司（盐田）"),
COMPNAME21("王林泉","王林泉"),
COMPNAME22("中外运","深圳中外运船务代理有限公司盐田分公司"),
COMPNAME23("其他","现金供应商"),
COMPNAME24("航姆","深圳市航姆国际船舶代理有限公司"),
COMPNAME25("刘秀花","刘秀花"),
COMPNAME26("盐田港国际资讯","盐田港国际资讯有限公司"),
COMPNAME27("元亨船代","深圳元亨国际船务代理有限公司"),
COMPNAME28("恒富船代","深圳市恒富国际船舶代理有限公司"),
COMPNAME29("佳裕达物流科技","深圳市佳裕达物流科技有限公司"),
COMPNAME30("奕诚","广州市奕诚国际货运代理有限公司"),
COMPNAME31("张晓萍 ","张晓萍"),
COMPNAME32("万港通","深圳市万港通货运代理有限公司"),
COMPNAME33("现金","现金供应商"),
COMPNAME34("通海报关","深圳市通海报关有限公司"),
COMPNAME35("金永物流","深圳市金永物流有限公司"),
COMPANY36("博亚通","深圳博亚通供应链管理有限公司"),
COMPANY37("威海蓝创","威海蓝创进出口有限公司"),
COMPANY38("依偎","依偎科技（南昌）有限公司"),
COMPANY39("中山威朗","中山市威朗电器有限公司"),
COMPANY40("巨诺","深圳市巨诺电子有限公司"),
COMPANY41("启航","深圳前海启航供应链管理有限公司"),
COMPANY42("杉川","深圳市杉川机器人有限公司"),
COMPANY43("腾派通","深圳腾派通电子有限公司"),
COMPANY44("海兆丹","青岛海兆丹国际电子商务有限公司"),
COMPANY45("坤鑫","深圳市坤鑫国际货运代理有限公司"),
COMPANY46("维沃","维沃通信科技有限公司"),
COMPANY47("佳裕达国际","深圳市佳裕达国际货运代理有限公司"),
COMPANY48("彦信","深圳市彦信国际货运代理有限公司"),
COMPANY49("鸿景达","深圳市鸿景达商贸有限公司"),
COMPANY50("佳裕达环球","深圳市佳裕达环球供应链有限公司"),
COMPANY51("上海星通","上海星通国际物流有限公司"),
COMPANY52("华运","深圳市华运报关行有限公司"),
COMPANY53("佳裕达物流科技","深圳市佳裕达物流科技有限公司"),
COMPANY54("欧迈伽","深圳市欧迈伽科技有限公司"),
COMPANY55("南伽科技","深圳市南伽科技信息有限公司"),
COMPANY56("湖南安克","湖南安克电子科技有限公司"),
COMPANY57("东莞冲港","东莞市冲港货运有限公司"),
COMPANY58("奕诚","广州市奕诚国际货运代理有限公司"),
COMPANY59("新昌玩具","新昌玩具制品(深圳)有限公司"),
COMPANY60("中誉","鄂州市中誉进出口贸易有限公司"),
COMPANY61("重庆沣达通","重庆沣达通供应链管理有限公司"),
COMPANY62("智侣科技","智侣科技（宁波）有限责任公司"),
COMPANY63("嘉博瑞","深圳市嘉博瑞实业有限公司"),
COMPANY64("堂唐","深圳市堂唐电子有限公司"),
COMPANY65("一键通","湖北一键通外贸服务股份有限公司"),
COMPANY66("联安","南京联安供应链有限公司"),
COMPANY67("江苏博仁","江苏博仁供应链管理有限公司"),
COMPANY68("靖来","瑞丽市靖来商贸有限公司"),
COMPANY69("陕西恒信","陕西恒信宝通电子科技有限公司"),
COMPANY70("智秦科技","江西智秦科技有限责任公司"),
COMPANY71("新宏源","新宏源供应链管理（江苏）有限公司"),
COMPANY72("东源顺","深圳市东源顺实业有限公司"),
COMPANY73("海创汇金","长治市海创汇金供应链管理有限公司"),
COMPANY74("惠众","苏州惠众电子设备有限公司"),
COMPANY75("惠州友喜","惠州市友喜照明产品有限公司"),
COMPANY76("佳裕达商贸","深圳市佳裕达商贸有限公司"),
COMPANY77("骏德","前海骏德供应链管理（深圳）有限公司"),
COMPANY78("民商创科","民商创科（宁波）电子商务有限公司"),
COMPANY79("民商科惠","民商科惠（宁波）科技有限公司"),
COMPANY80("闽清兴富隆","闽清兴富隆实业有限公司"),
COMPANY81("明德","宜宾明德通讯技术有限公司"),
COMPANY82("伟月诚","江苏伟月诚电子科技有限公司"),
COMPANY83("物流科技（中港散货）","深圳市佳裕达物流科技有限公司"),
COMPANY84("智发物流","深圳市智发物流有限公司"),
COMPANY85("惠州巴士","惠州市巴士悦信物流有限公司"),
COMPANY86("信泰光学","信泰光学(深圳)有限公司"),
COMPANY87("海能","遂川县海能电子有限公司"),
COMPANY88("普航","深圳市普航国际货运代理有限公司"),
COMPANY89("江海","深圳市江海国际货运代理有限公司"),
COMPANY90("重庆甯格","重庆甯格供应链管理有限公司"),
COMPANY91("琴音","广州市琴音电子有限公司"),
COMPANY92("隆衡","隆衡（福建）进出口贸易有限公司"),
COMPANY93("沃歌","沃歌(上海)品牌管理有限公司"),
COMPANY94("英华","江苏英华供应链管理有限公司"),
COMPANY95("海能","海能电子(深圳)有限公司"),
COMPANY96("富乐奇","深圳富乐奇实业有限公司"),
COMPANY97("拓海","苏州市拓海国际货运代理有限公司"),
COMPANY98("润升","福州润升电子科技有限公司"),
COMPANY99("鑫海翔","深圳市鑫海翔国际货运代理有限公司"),
COMPANY100("前海万方","深圳市前海万方供应链有限公司"),
COMPANY101("旭成","深圳市旭成国际物流有限公司"),
COMPANY102("众缔","上海众缔进出口有限公司"),
COMPANY103("汇捷通","深圳市汇捷通国际货运代理有限公司"),
COMPANY104("连展","连展科技电子(昆山)有限公司"),

    ;


private String yunbaoguan;
private String kingdee;

    /**
     * 通过输入云报关的公司名称，尝试匹配金蝶的公司名称
     *
     * @param yunbaoguanCompName
     * @return
     */
    public static CustomsCompanyEnum getEnum(String yunbaoguanCompName) {
        for (CustomsCompanyEnum value : CustomsCompanyEnum.values()) {
            if (value.getYunbaoguan().equals(yunbaoguanCompName)) {
                return value;
            }
        }
        return null;
    }

}
